import React from 'react'
import { Container } from 'react-bootstrap'

function Privacy() {
  return (
    <Container className='rules'>
      <h1 className="text-center f4">プライバシーポリシー</h1>
      <p>
      本プライバシーポリシー（以下「本ポリシー」）は、本サービス（以下「本サービス」）における
      ユーザーの個人情報の取り扱いについて定めるものです。
      ユーザーは、本サービスを利用することで、本ポリシーに同意したものとみなします。
      </p>
      <h2 className="fs-4">第1条(取得する情報)</h2>
      <p>本サービスでは、以下の情報を取得する場合があります。</p>
      <ol>
        <li>
          ユーザーが提供する情報
          <ul>
            <li>アカウント登録時の情報(ニックネーム、メールアドレスなど)</li>
            <li>プロフィール情報（例：アイコン画像、自己紹介など）</li>
            <li>投稿・コメントなどのコンテンツ</li>
          </ul>
        </li>
        <li>
          利用時に自動取得される情報
          <ul>
            <li>デバイス情報、ブラウザ情報</li>
            <li>クッキー（Cookie）や類似技術による情報</li>
            <li>広告表示やクリックの記録</li>
            <li>チャットやレビューに紐づくIPアドレス</li>
          </ul>
        </li>
        <li>第三者サービスとの連携時に取得する情報</li>
        <p>
          外部サービス（Google、Facebook など）と連携した場合、
          許可された範囲で当該サービスから情報を取得する場合があります。
        </p>
      </ol>
      <h2 className="fs-4">第2条(情報の利用目的)</h2>
      <p>取得した情報は、以下の目的で利用します。</p>
      <ul>
        <li>本サービスの提供・運営のため</li>
        <li>ユーザーサポート（問い合わせ対応など）のため</li>
        <li>不正行為の防止・セキュリティ対策のため</li>
        <li>広告の表示・効果測定のため（ただし、金銭の取り扱いはなし）</li>
        <li>サービス改善・新機能の開発のため</li>
        <li>法令遵守や権利保護のため</li>
      </ul>
      <h2 className="fs-4">第3条(情報の共有・提供)</h2>
      <p>本サービスは、以下の場合を除き、ユーザーの情報を第三者に提供することはありません。</p>
      <ul>
        <li>ユーザーの同意がある場合</li>
        <li>法令に基づく場合（裁判所や警察からの開示請求など）</li>
        <li>不正行為の防止・セキュリティ対策が必要な場合</li>
        <li>サービス運営上、業務委託が必要な場合（例：サーバー管理、広告配信業者との連携）</li>
      </ul>
      <h2 className="fs-4">第4条(クッキー(Cookie)等の利用)</h2>
      <p>本サービスでは、以下の目的でクッキーや類似技術を使用することがあります。</p>
      <ul>
        <li>ユーザーの利便性向上（ログイン状態の保持など）</li>
        <li>広告の最適化</li>
        <li>アクセス解析（Google Analytics等の利用）</li>
      </ul>
      <p>ユーザーは、ブラウザの設定を変更することでクッキーの使用を拒否することができますが、一部機能が制限される場合があります。</p>
      <h2 className="fs-4">第5条(情報の管理)</h2>
      <p>本サービスは、適切な技術的・組織的対策を講じ、個人情報の漏洩や不正アクセスを防止します。</p>
      <ul>
        <li>データの保持期間
        ユーザーの情報は、サービスの提供に必要な期間保持し、不要になった情報は適切に削除します。</li>
        <li>ユーザーによる情報の管理
        ユーザーは、自身のアカウント情報の確認・変更・削除を行うことができます。</li>
      </ul>
      <h2 className="fs-4">第6条(未成年の利用)</h2>
      <p>本サービスは、未成年者が利用する場合、保護者の同意を得たものとみなします。</p>
      <h2 className="fs-4">第7条(ポリシーの変更)</h2>
      <p>本ポリシーは、必要に応じて変更されることがあります。重要な変更がある場合は、事前に通知します。</p>
      <h2 className="fs-4">第8条(お問い合わせ)</h2>
      <p>本ポリシーに関するお問い合わせは、以下の連絡方法で受け付けます。</p>
    </Container>
  )
}

export default Privacy